Pandas

# Series de pandas

In [2]:
import pandas as pd
import numpy as np

In [4]:
diccionario = {"Matemáticas": 6.0, "Economía": 4.5,  "Programación": 8.5}

In [5]:
serie_1 = pd.Series(diccionario)

In [6]:
serie_1

Matemáticas     6.0
Economía        4.5
Programación    8.5
dtype: float64

In [7]:
type(serie_1)

pandas.core.series.Series

#Atributos de una serie

In [8]:
serie_2 = pd.Series([1,2,2,3,3,3,4,4,4,4])

In [9]:
serie_2

0    1
1    2
2    2
3    3
4    3
5    3
6    4
7    4
8    4
9    4
dtype: int64

In [10]:
serie_2.size # Tamaño

10

In [11]:
serie_2.index # índice

RangeIndex(start=0, stop=10, step=1)

In [12]:
serie_2.dtype #tipo de dato

dtype('int64')

In [13]:
serie_1[2] #Al traer el índice de un origen tipo diccionario, trae los valoes del "key"

8.5

In [14]:
serie_1.index

Index(['Matemáticas', 'Economía', 'Programación'], dtype='object')

In [20]:
array = np.arange(5,30,5)
array

array([ 5, 10, 15, 20, 25])

In [21]:
serie_3 = pd.Series(array, index=["uno","dos","tres","cuatro","cinco"]) #gregarle nombre a los índices.
serie_3

uno        5
dos       10
tres      15
cuatro    20
cinco     25
dtype: int32

In [22]:
serie_3.count()

5

In [23]:
serie_3.sum() #Resultados.

75

In [24]:
serie_3.cumsum() # Suma por acomulación.

uno        5
dos       15
tres      30
cuatro    50
cinco     75
dtype: int32

In [25]:
serie_3.value_counts() # Nos permite saber las veces que se repite un valor.

5     1
10    1
15    1
20    1
25    1
Name: count, dtype: int64

In [26]:
serie_3.describe() # Permite obtener el máximo,el mínimo, la media, la desviación estándar, el valor en el 25%, el 50% y el 75% de la media.

count     5.000000
mean     15.000000
std       7.905694
min       5.000000
25%      10.000000
50%      15.000000
75%      20.000000
max      25.000000
dtype: float64

In [34]:
serie_int = pd.Series(np.random.randint(10,30,100))
serie_int

0     19
1     13
2     12
3     29
4     15
      ..
95    15
96    16
97    27
98    14
99    26
Length: 100, dtype: int32

In [35]:
serie_int.describe()

count    100.000000
mean      19.020000
std        5.338974
min       10.000000
25%       14.750000
50%       18.500000
75%       23.000000
max       29.000000
dtype: float64

In [36]:
def to_string(s):
    return "valor: " + str(s)

In [37]:
to_string(560)

'valor: 560'

In [38]:
serie_int.apply(to_string)

0     valor: 19
1     valor: 13
2     valor: 12
3     valor: 29
4     valor: 15
        ...
95    valor: 15
96    valor: 16
97    valor: 27
98    valor: 14
99    valor: 26
Length: 100, dtype: object

# DataFrames

In [42]:
datos = {
    "nombre": ["María","Luis","Carmen","Antonio"],
    "edad": [18,22,20,21],
    "grado": ["Economía","Medicina","Arquitectura","Economía"],
    "correo": ["m.26@gmail","lu236@hotmail.com","carmen_25@gmail.com","anto52@hotmail.com"]
}

In [44]:
pd.DataFrame(datos, index = ["alumno1", "alumno2","alumno3","alumno4"])

          nombre  edad         grado               correo
alumno1    María    18      Economía           m.26@gmail
alumno2     Luis    22      Medicina    lu236@hotmail.com
alumno3   Carmen    20  Arquitectura  carmen_25@gmail.com
alumno4  Antonio    21      Economía   anto52@hotmail.com

# Creación de DataFrame a partir de un archivo csv

In [39]:
# variable = pd.read_csv("Nombre archivo",sep = "", decimal = "")

In [41]:
colesterol = pd.read_csv("colesterol.csv",sep=";",decimal=",")

colesterol

                             nombre  edad sexo   peso  altura  colesterol
0      José Luis Martínez Izquierdo    18    H   85.0    1.79       182.0
1                    Rosa Díaz Díaz    32    M   65.0    1.73       232.0
2             Javier García Sánchez    24    H    NaN    1.81       191.0
3               Carmen López Pinzón    35    M   65.0    1.70       200.0
4              Marisa López Collado    46    M   51.0    1.58       148.0
5                 Antonio Ruiz Cruz    68    H   66.0    1.74       249.0
6           Antonio Fernández Ocaña    51    H   62.0    1.72       276.0
7             Pilar Martín González    22    M   60.0    1.66         NaN
8              Pedro Gálvez Tenorio    35    H   90.0    1.94       241.0
9           Santiago Reillo Manzano    46    H   75.0    1.85       280.0
10            Macarena Álvarez Luna    53    M   55.0    1.62       262.0
11       José María de la Guía Sanz    58    H   78.0    1.87       198.0
12  Miguel Angel Cuadrado Gutiérrez    27    H  109.0    1.98       210.0
13            Carolina Rubio Moreno    20    M   61.0    1.77       194.0

In [47]:
emisiones = pd.read_csv(r"C:\Users\dmon2\OneDrive\Documentos\Henry\Estudio\M1\Clase 2\Emisiones_CO2.csv",sep="|", encoding = "latin-1",decimal=",", thousands=".")

In [48]:
emisiones

,Código de país,Nombre del país,Región,Año,CO2 (kt),CO2 per cápita (toneladas métricas)
0,ABW,Aruba,América Latina y Caribe,1960,NaN,NaN
1,ABW,Aruba,América Latina y Caribe,1961,NaN,NaN
2,ABW,Aruba,América Latina y Caribe,1962,NaN,NaN
3,ABW,Aruba,América Latina y Caribe,1963,NaN,NaN
4,ABW,Aruba,América Latina y Caribe,1964,NaN,NaN
...,...,...,...,...,...,...
11122,ZWE,Zimbabue,África subsahariana,2007,9732.22,0.731867
11123,ZWE,Zimbabue,África subsahariana,2008,7682.37,0.569255
11124,ZWE,Zimbabue,África subsahariana,2009,8239.75,0.600521
11125,ZWE,Zimbabue,África subsahariana,2010,9028.15,0.646073
11126,ZWE,Zimbabue,África subsahariana,2011,9860.56,0.691698

In [ ]:
# dataframe.head("valor") trae el número de filas de arriba a abajo.

# dataframe.tail("valor") trae el número de filas de abajo hacia arriba.

# dataframe.shape - trae el número de filas y columnas.

# dataframe.size - regresa el número de columnas por filas. 

# dataframe.columns - trae el nombre de las columnas.

# dataframe.index

# dataframe.dtypes- trae el tipo de valor por columna.

In [49]:
emisiones.head() # Por default es 5.

,Código de país,Nombre del país,Región,Año,CO2 (kt),CO2 per cápita (toneladas métricas)
0,ABW,Aruba,América Latina y Caribe,1960,NaN,NaN
1,ABW,Aruba,América Latina y Caribe,1961,NaN,NaN
2,ABW,Aruba,América Latina y Caribe,1962,NaN,NaN
3,ABW,Aruba,América Latina y Caribe,1963,NaN,NaN
4,ABW,Aruba,América Latina y Caribe,1964,NaN,NaN

In [50]:
emisiones.tail()

,Código de país,Nombre del país,Región,Año,CO2 (kt),CO2 per cápita (toneladas métricas)
11122,ZWE,Zimbabue,África subsahariana,2007,9732.22,0.731867
11123,ZWE,Zimbabue,África subsahariana,2008,7682.37,0.569255
11124,ZWE,Zimbabue,África subsahariana,2009,8239.75,0.600521
11125,ZWE,Zimbabue,África subsahariana,2010,9028.15,0.646073
11126,ZWE,Zimbabue,África subsahariana,2011,9860.56,0.691698

In [51]:
emisiones.shape

(11127, 6)

In [52]:
emisiones.size

66762

In [54]:
emisiones.columns

Index(['Código de país', 'Nombre del país', 'Región', 'Año', 'CO2 (kt)',
       'CO2 per cápita (toneladas métricas)'],
      dtype='object')

In [55]:
emisiones.index

RangeIndex(start=0, stop=11127, step=1)

In [57]:
emisiones.dtypes

Código de país                          object
Nombre del país                         object
Región                                  object
Año                                      int64
CO2 (kt)                               float64
CO2 per cápita (toneladas métricas)    float64
dtype: object

In [58]:
colesterol

                             nombre  edad sexo   peso  altura  colesterol
0      José Luis Martínez Izquierdo    18    H   85.0    1.79       182.0
1                    Rosa Díaz Díaz    32    M   65.0    1.73       232.0
2             Javier García Sánchez    24    H    NaN    1.81       191.0
3               Carmen López Pinzón    35    M   65.0    1.70       200.0
4              Marisa López Collado    46    M   51.0    1.58       148.0
5                 Antonio Ruiz Cruz    68    H   66.0    1.74       249.0
6           Antonio Fernández Ocaña    51    H   62.0    1.72       276.0
7             Pilar Martín González    22    M   60.0    1.66         NaN
8              Pedro Gálvez Tenorio    35    H   90.0    1.94       241.0
9           Santiago Reillo Manzano    46    H   75.0    1.85       280.0
10            Macarena Álvarez Luna    53    M   55.0    1.62       262.0
11       José María de la Guía Sanz    58    H   78.0    1.87       198.0
12  Miguel Angel Cuadrado Gutiérrez    27    H  109.0    1.98       210.0
13            Carolina Rubio Moreno    20    M   61.0    1.77       194.0

In [59]:
colesterol.rename(columns={"nombre":"Nombre completo","altura":"Altura en m"})

                    Nombre completo  edad sexo   peso  Altura en m  colesterol
0      José Luis Martínez Izquierdo    18    H   85.0         1.79       182.0
1                    Rosa Díaz Díaz    32    M   65.0         1.73       232.0
2             Javier García Sánchez    24    H    NaN         1.81       191.0
3               Carmen López Pinzón    35    M   65.0         1.70       200.0
4              Marisa López Collado    46    M   51.0         1.58       148.0
5                 Antonio Ruiz Cruz    68    H   66.0         1.74       249.0
6           Antonio Fernández Ocaña    51    H   62.0         1.72       276.0
7             Pilar Martín González    22    M   60.0         1.66         NaN
8              Pedro Gálvez Tenorio    35    H   90.0         1.94       241.0
9           Santiago Reillo Manzano    46    H   75.0         1.85       280.0
10            Macarena Álvarez Luna    53    M   55.0         1.62       262.0
11       José María de la Guía Sanz    58    H   78.0         1.87       198.0
12  Miguel Angel Cuadrado Gutiérrez    27    H  109.0         1.98       210.0
13            Carolina Rubio Moreno    20    M   61.0         1.77       194.0

In [ ]:
# Cuando se describen los atributos del objeto, no se requiere colocar "()", cuando es una función, lo requiere.

# Se una dataframe cuando se tienen estructuras tabulares.

In [61]:
colesterol.iloc[0:3] #Trae una serie de filas.

                         nombre  edad sexo  peso  altura  colesterol
0  José Luis Martínez Izquierdo    18    H  85.0    1.79       182.0
1                Rosa Díaz Díaz    32    M  65.0    1.73       232.0
2         Javier García Sánchez    24    H   NaN    1.81       191.0

In [63]:
colesterol["IMC"] = colesterol["peso"] / colesterol["altura"]**2

colesterol

,nombre,edad,sexo,peso,altura,colesterol,IMC
0,José Luis Martínez Izquierdo,18,H,85.0,1.79,182.0,26.528510
1,Rosa Díaz Díaz,32,M,65.0,1.73,232.0,21.718066
2,Javier García Sánchez,24,H,NaN,1.81,191.0,NaN
3,Carmen López Pinzón,35,M,65.0,1.70,200.0,22.491349
4,Marisa López Collado,46,M,51.0,1.58,148.0,20.429418
5,Antonio Ruiz Cruz,68,H,66.0,1.74,249.0,21.799445
6,Antonio Fernández Ocaña,51,H,62.0,1.72,276.0,20.957274
7,Pilar Martín González,22,M,60.0,1.66,NaN,21.773842
8,Pedro Gálvez Tenorio,35,H,90.0,1.94,241.0,23.913275
9,Santiago Reillo Manzano,46,H,75.0,1.85,280.0,21.913806
10,Macarena Álvarez Luna,53,M,55.0,1.62,262.0,20.957171
11,José María de la Guía Sanz,58,H,78.0,1.87,198.0,22.305471
12,Miguel Angel Cuadrado Gutiérrez,27,H,109.0,1.98,210.0,27.803285
13,Carolina Rubio Moreno,20,M,61.0,1.77,194.0,19.470778

In [64]:
colesterol.iloc[:4,[0,5]] # Se pueden traer datos de diversas columbnas.

                         nombre  colesterol
0  José Luis Martínez Izquierdo       182.0
1                Rosa Díaz Díaz       232.0
2         Javier García Sánchez       191.0
3           Carmen López Pinzón       200.0

In [65]:
colesterol.to_csv("PRUEBA.csv")

In [66]:
colesterol.loc[:,["nombre","colesterol"]]

                             nombre  colesterol
0      José Luis Martínez Izquierdo       182.0
1                    Rosa Díaz Díaz       232.0
2             Javier García Sánchez       191.0
3               Carmen López Pinzón       200.0
4              Marisa López Collado       148.0
5                 Antonio Ruiz Cruz       249.0
6           Antonio Fernández Ocaña       276.0
7             Pilar Martín González         NaN
8              Pedro Gálvez Tenorio       241.0
9           Santiago Reillo Manzano       280.0
10            Macarena Álvarez Luna       262.0
11       José María de la Guía Sanz       198.0
12  Miguel Angel Cuadrado Gutiérrez       210.0
13            Carolina Rubio Moreno       194.0

In [67]:
colesterol.loc[colesterol["sexo"] == "H"] #Condiciones boolenas para realizar filtrados.

,nombre,edad,sexo,peso,altura,colesterol,IMC
0,José Luis Martínez Izquierdo,18,H,85.0,1.79,182.0,26.528510
2,Javier García Sánchez,24,H,NaN,1.81,191.0,NaN
5,Antonio Ruiz Cruz,68,H,66.0,1.74,249.0,21.799445
6,Antonio Fernández Ocaña,51,H,62.0,1.72,276.0,20.957274
8,Pedro Gálvez Tenorio,35,H,90.0,1.94,241.0,23.913275
9,Santiago Reillo Manzano,46,H,75.0,1.85,280.0,21.913806
11,José María de la Guía Sanz,58,H,78.0,1.87,198.0,22.305471
12,Miguel Angel Cuadrado Gutiérrez,27,H,109.0,1.98,210.0,27.803285